title: Connection to RDP port (3389) (base)
name: fw_connection_port_3389
id: e8b91daa-520a-4eb6-ba43-581362b75912
rule_type: base
status: test
description: Base rule for firewall traffic targeting RDP port 3389.
references:
    - source_ref: CONTENT_Rules Pre-Deployment_v0.1.json#7-9
author: AnhPT127
date: 2026-03-30
modified: 2026-03-30
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: firewall
    product: any
    service: traffic
detection:
    selection:
        dest_port: 3389
    condition: selection
falsepositives:
    - Legitimate RDP traffic
fields:
    - _time
    - src_ip
    - src_port
    - src_zone
    - dest_ip
    - dest_port
    - dest_zone
    - action
    - firewall_policy_name
    - rule_action
    - protocol
    - event_count
level: informational
version: 1.0.0
