title: Connection to port 21 from public IP (base)
name: fw_external_connection_port_21
id: 33b58f32-ab9c-4458-889f-633c03103da3
status: test
description: External connection to FTP port (21)
references:
    - Internal_HaoDA4
author: AnhPT127
date: 2025-12-17
modified: 2025-12-17
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: firewall
    product: paloalto
    service: traffic
detection:
    selection:
        dst_port: 21
    filter_private_ip:
        src_ip|cidr:
            - 10.0.0.0/8
            - 192.168.0.0/16
            - 172.16.0.0/12
    filter_blocked:
        action: blocked
    condition: selection and not (filter_private_ip or filter_blocked)
---
title: Posible SCAN FTP Port (21) (External Allowed)
status: test
description: Request volume from a single source IP exceeds threshold within 1 hour
correlation:
    type: event_count
    rules:
        - fw_external_connection_port_21
    group-by:
        - src_ip
    timespan: 1h
    condition:
        gt: 0
fields:
    - src_ip
    - dest_ip
    - action
    - count
falsepositives:
    - Unknown
level: high

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: low, risk_score: 10 }
    search_query: |
        index=firewall sourcetype=traffic action!=blocked dest_port=21 NOT (src_ip=10.0.0.0/8 OR src_ip=192.168.0.0/16 OR src_ip=172.16.0.0/12)
        | bucket _time span=1h
        | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) AS Time 
        | eval Alert_Severity="High"  
        | stats values(action) as Action, values(dst_ip) as "Dest IP", values(dst_port) as "Dest Port" count by Alert_Severity Time src_ip
        | sort - count
