title: External connection to port 135
name: fw_external_connection_port_135
id: e144949c-bd21-4ea3-a196-37678617d190
status: test
description: Connection to RPC port (135) that is accepted by firewall
references:
    - ELK Security rules
author: AnhPT127
date: 2026-01-12
modified: 2026-01-12
tags:
    - attack.exfiltration
    - attack.t1048
logsource:
    category: firewall
    product: any
    service: traffic
detection:
    selection_port:
        dst_port: 135
    selection_protocol:
        protocol:
            - tcp
            - 6
    filter_blocked:
        action:
            - blocked
            - dropped
            - denied
            - dropped
            - deny
    filter_private_ip:
        src_ip|cidr:
            - 10.0.0.0/8
            - 127.0.0.0/8
            - 169.254.0.0/16
            - 172.16.0.0/12
            - 192.0.0.0/24
            - 192.0.0.0/29
            - 192.0.0.8/32
            - 192.0.0.9/32
            - 192.0.0.10/32
            - 192.0.0.170/32
            - 192.0.0.171/32
            - 192.0.2.0/24
            - 192.31.196.0/24
            - 192.52.193.0/24
            - 192.168.0.0/16
            - 192.88.99.0/24
            - 224.0.0.0/4
            - 100.64.0.0/10
            - 192.175.48.0/24
            - 198.18.0.0/15
            - 198.51.100.0/24
            - 203.0.113.0/24
            - 240.0.0.0/4
    condition: selection_port and selection_protocol and not (filter_blocked and filter_private_ip)
---
title: RPC (Remote Procedure Call) from the Internet
status: test
description: Request volume from a single source IP exceeds threshold within 15 minutes
correlation:
    type: event_count
    rules:
        - fw_external_connection_port_135
    group-by:
        - src_ip
    timespan: 15m
    condition:
        gt: 0
fields:
    - _time
    - src_ip
    - src_port
    - src_zone
    - dest_ip
    - dest_port
    - dest_zone
    - action
    - firewall_policy_name
    - protocol
    - event_count
falsepositives:
    - Unknown
level: high

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "*/15 * * * *"
        earliest: "-15m"
        latest: "now"
        notable: { enabled: true, severity: high, risk_score: 73 }
    search_query: |
        index=firewall sourcetype=traffic dst_port=135 protocol IN ("tcp", 6) NOT (action IN ("blocked", "dropped", "denied", "dropped", "deny") src_ip="10.0.0.0/8" OR src_ip="127.0.0.0/8" OR src_ip="169.254.0.0/16" OR src_ip="172.16.0.0/12" OR src_ip="192.0.0.0/24" OR src_ip="192.0.0.0/29" OR src_ip="192.0.0.8/32" OR src_ip="192.0.0.9/32" OR src_ip="192.0.0.10/32" OR src_ip="192.0.0.170/32" OR src_ip="192.0.0.171/32" OR src_ip="192.0.2.0/24" OR src_ip="192.31.196.0/24" OR src_ip="192.52.193.0/24" OR src_ip="192.168.0.0/16" OR src_ip="192.88.99.0/24" OR src_ip="224.0.0.0/4" OR src_ip="100.64.0.0/10" OR src_ip="192.175.48.0/24" OR src_ip="198.18.0.0/15" OR src_ip="198.51.100.0/24" OR src_ip="203.0.113.0/24" OR src_ip="240.0.0.0/4")        
        | bin _time span=15m
        | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) AS Time 
        | eval Alert_Severity="High"
        | stats count as event_count by _time src_ip
        | search event_count > 0 
        | table Time,Alert_Severity,src_ip,src_port,src_zone,dest_ip,dest_port,dest_zone,action,firewall_policy_name,protocol,event_count
