title: Antivirus Password Dumper Detection
name: av_password_dumper
rule_type: detection
id: 78cc2dd2-7d20-4d32-93ff-057084c38b93
status: test
description: 'Detects a highly relevant Antivirus alert that reports a password dumper.

  This event must not be ignored just because the AV has blocked the malware but investigate, how it came there in the first place.

  '
references:
- source_ref: sigma:78cc2dd2-7d20-4d32-93ff-057084c38b93
- https://www.nextron-systems.com/?s=antivirus
- https://www.virustotal.com/gui/file/5fcda49ee7f202559a6cbbb34edb65c33c9a1e0bde9fa2af06a6f11b55ded619
- https://www.virustotal.com/gui/file/a4edfbd42595d5bddb442c82a02cf0aaa10893c1bf79ea08b9ce576f82749448
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2018-09-09
modified: 2026-03-28
tags:
- attack.credential-access
- attack.t1003
- attack.t1558
- attack.t1003.001
- attack.t1003.002
logsource:
  category: antivirus
  product: any
  service: any
detection:
  selection:
  - Signature|startswith: PWS
  - Signature|contains:
    - Certify
    - DCSync
    - DumpCreds
    - DumpLsass
    - DumpPert
    - HTool/WCE
    - Kekeo
    - Lazagne
    - LsassDump
    - Mimikatz
    - MultiDump
    - Nanodump
    - NativeDump
    - Outflank
    - PShlSpy
    - PSWTool
    - PWCrack
    - PWDump
    - PWS.
    - PWSX
    - pypykatz
    - Rubeus
    - SafetyKatz
    - SecurityTool
    - SharpChrome
    - SharpDPAPI
    - SharpDump
    - SharpKatz
    - SharpS.
    - ShpKatz
    - TrickDump
  condition: selection
falsepositives:
- Unlikely
fields:
- threat_name
- file_name
- file_path
- file_hash
- hostname
- ipv4
- user
- processname
- action_taken
level: critical
x_query:
  splunk: '(threat_name="PWS*" OR threat_name IN ("*Certify*", "*DCSync*", "*DumpCreds*", "*DumpLsass*", "*DumpPert*", "*HTool/WCE*", "*Kekeo*", "*Lazagne*", "*LsassDump*", "*Mimikatz*", "*MultiDump*", "*Nanodump*", "*NativeDump*", "*Outflank*", "*PShlSpy*", "*PSWTool*", "*PWCrack*", "*PWDump*", "*PWS.*", "*PWSX*", "*pypykatz*", "*Rubeus*", "*SafetyKatz*", "*SecurityTool*", "*SharpChrome*", "*SharpDPAPI*", "*SharpDump*", "*SharpKatz*", "*SharpS.*", "*ShpKatz*", "*TrickDump*"))

    | bucket _time span=15m

    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) as Time

    | eval Alert_Severity="High"

    | stats values(action_taken) as action_taken values(file_name) as file_name values(file_path) as file_path values(file_hash) as file_hash values(hostname) as hostname values(processname) as processname values(threat_name) as threat_name values(user) as user count by Alert_Severity Time ipv4

    | fillnull value=N/A action_taken file_name file_path file_hash processname user

    '
x_splunk_es:
  targets:
    ingest_targets:
    - device_id: eset-ra
      dataset_id: eset-ra-alerts
      index: epav
      sourcetype: eset:ra
    - device_id: mcafee-epo
      dataset_id: mcafee-epo-syslog
      index: epav
      sourcetype: mcafee:epo:syslog
    index: epav
    schedule_cron: '*/30 * * * *'
    earliest: -30m
    latest: now
    notable:
      enabled: true
      severity: critical
      risk_score: 90
    enabled: true
  search_query: '(threat_name="PWS*" OR threat_name IN ("*Certify*", "*DCSync*", "*DumpCreds*", "*DumpLsass*", "*DumpPert*", "*HTool/WCE*", "*Kekeo*", "*Lazagne*", "*LsassDump*", "*Mimikatz*", "*MultiDump*", "*Nanodump*", "*NativeDump*", "*Outflank*", "*PShlSpy*", "*PSWTool*", "*PWCrack*", "*PWDump*", "*PWS.*", "*PWSX*", "*pypykatz*", "*Rubeus*", "*SafetyKatz*", "*SecurityTool*", "*SharpChrome*", "*SharpDPAPI*", "*SharpDump*", "*SharpKatz*", "*SharpS.*", "*ShpKatz*", "*TrickDump*"))

    | bucket _time span=15m

    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) as Time

    | eval Alert_Severity="High"

    | stats values(action_taken) as action_taken values(file_name) as file_name values(file_path) as file_path values(file_hash) as file_hash values(hostname) as hostname values(processname) as processname values(threat_name) as threat_name values(user) as user count by Alert_Severity Time ipv4

    | fillnull value=N/A action_taken file_name file_path file_hash processname user'
