title: OpenCTI - DDOS IPv4 Detected by Checkpoint
id: b27g75f1-44g9-581b-c1e4-c9def37bcgeb
status: deprecated
description: Detects network traffic where the destination IP matches known DDOS IPv4 addresses as identified by OpenCTI and logged by Checkpoint firewalls.
references:
    - https://www.opencti.io/
    - Internal: HaoDA4
author: AnhPT127
date: 2026-02-06
modified: 2026-02-06
tags:
    - attack.t1499
    - attack.resource_development
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        dest_ip:
        # Placeholder for DDOS IPv4 addresses from OpenCTI
        # lookup FPT-DDOS-IPv4
    filter_private_ip:
        dest_ip|cidr:
            - 
    condition: selection and filter_private_ip
falsepositives:
    - Unknown
level: high

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: high, risk_score: 50 }
    search_query: |
        (index=$INDEX$ sourcetype=$SOURCETYPE$) (dest_ip="10.0.0.0/8" OR dest_ip="172.16.0.0/12" OR dest_ip="192.168.0.0/16")
        | search
            [| inputlookup FPT-DDOS-IPv4 | rename value as src_ip | fields src_ip]
        | bucket _time span=1h
        | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium" 
        | stats values(proto) as Protocol_Number values(src_user) as Source_User, values(action) as Action, values(attack) as Attack_Info count by Alert_Severity Time src_ip dest_ip
        | rename src_ip as Source_IP dest_ip as Dest_IP
        | where count >= 500
        | fillnull value=N/A Protocol_Number Dest_IP Source_User Action Attack_Info