title: Posible SCAN SSH Port (22) To Multiple Host
id: 9dbd6f76-6bcc-456c-8f6b-88df38e0d232
status: test
description: Detects multiple connection attempts to SSH port (22) from a single source IP address to multiple destination IP addresses, indicating a possible port scan activity.
references:
    - https://www.checkpoint.com/
    - Internal: Hao
author: AnhPT127
date: 2026-02-10
modified: 2026-02-10
tags:
    - attack.t1046
    - attack.network_scanning
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        dest_port: 22
    condition: selection
falsepositives:
    - Legitimate network scanning activities
level: medium

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: medium, risk_score: 30 }
    search_query: |
        index=* sourcetype=cp_log (tag=network OR tag=communicate) dest_port=22 (dest_ip="10.0.0.0/8" OR dest_ip="172.16.0.0/12" OR dest_ip="192.168.0.0/16") NOT (src="10.14.124.0/24" OR src="10.14.125.0/24" OR src="10.14.126.0/24" OR src="10.14.127.0/24" OR src="10.15.30.0/24" OR src="10.15.31.0/24" OR src="10.15.16.68" OR src="10.15.16.69" OR src="10.201.75.0/24" OR src="10.14.60.0/24" OR src_ip="10.14.128.10") 
        | bucket _time span=1h
        | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium"  
        | stats values(sourcetype) as "Source Type" values(action) as action values(dest_ip) as dest_ip dc(dest_ip) as Total_dest values(dest_port) as dest_port count by Alert_Severity Time src
        | rename src as src_ip
        | where Total_dest >= 5 AND count > 100