title: Single IP connects to multiple IP on Single Port
id: 557f8afb-503a-4971-bd45-355b18c3a360
status: test
description: Detects multiple connection attempts from a single source IP address to multiple destination IP addresses on a specific port, indicating potential scanning or reconnaissance activity.
references:
    - https://www.checkpoint.com/
    - Internal: Hao
author: AnhPT127
date: 2026-02-10
modified: 2026-02-10
tags:
    - attack.t1046
    - attack.network_scanning
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        dest_port: 22
    condition: selection
falsepositives:
    - Legitimate network scanning activities
level: medium

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: medium, risk_score: 30 }
    search_query: |
        ((index=main sourcetype=fortinet) OR (index=checkpoint sourcetype=cp_log)) (dest_ip="10.0.0.0/8" OR dest_ip="172.16.0.0/12" OR dest_ip="192.168.0.0/16") 
        (src!=10.15.16.68 dest_port!=53) ```DNS Server```
        | bucket _time span=1h  
        | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium" 
        | stats values(action) as Action values(dest) as dest dc(dest) as uniq_count_dest count by Alert_Severity Time src dest_port  
        | eval dest=mvindex(dest,0,9)
        | where  uniq_count_dest >= 255 AND count >= 2000 ```Numbers of IPs in /24 Range```