title: OpenCTI - Attacker IPv4 Detected by Dest IP on Checkpoint
id: b27g75f1-44g9-581b-c1e4-c9def37bcgeb
status: deprecated
description: Detects network traffic where the destination IP matches known attacker IPv4 addresses as identified by OpenCTI and logged by Checkpoint firewalls.
references:
    - https://www.opencti.io/
    - Internal: HaoDA4
author: AnhPT127
date: 2026-02-06
modified: 2026-02-06
tags:
    - attack.t1071
    - attack.command_and_control
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        dest_ip:
        # Placeholder for attacker IPv4 addresses from OpenCTI
        # lookup FPT-Attacker-IPv4
    filter_private_ip:
        src_ip|cidr:
            - 10.0.0.0/8
    condition: selection and filter_private_ip
falsepositives: 
    - Unknown
level: high

splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: high, risk_score: 50 }
    search_query: |
        (index=$INDEX$ sourcetype=$SOURCETYPE$) dest_ip=* action!=Drop (src_ip="10.0.0.0/8" OR src_ip="172.16.0.0/12" OR src_ip="192.168.0.0/16")
        | search
            [| inputlookup FPT-Attacker-IPv4 | rename value as dest_ip | fields dest_ip]
        | bucket _time span=1h
        | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium" 
        | stats values(proto) as Protocol_Number values(dest_ip) as Dest_IP , values(src_user) as Source_User, values(action) as Action, values(attack) as Attack_Info count by Alert_Severity Time src_ip
        | rename src_ip as Source_IP
        | fillnull value=N/A Protocol_Number Dest_IP Source_User Action Attack_Info