title: OpenCTI - Ransomware IPv4 Detected by Source IP on Checkpoint
id: i94n42m8-bbn6-c58h-j8k1-j6klm04iljhi
status: deprecated
description: Detects network traffic where the source IP matches known Ransomware IPv4 addresses as identified by OpenCTI and logged by Checkpoint firewalls.
references: 
    - https://www.opencti.io/
    - Internal: HaoDA4
author: AnhPT127
date: 2026-02-06
modified: 2026-02-06
tags:
    - attack.t1486
    - attack.ransomware
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        src_ip:
        # Placeholder for Ransomware IPv4 from OpenCTI
        # lookup FPT-Ransomware-IPv4
    condition: selection
falsepositives:
    - Unknown
level: high

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: high, risk_score: 50 }
    search_query: |
        (index=$INDEX$ sourcetype=$SOURCETYPE$) (dest_ip="10.0.0.0/8" OR dest_ip="172.16.0.0/12" OR dest_ip="192.168.0.0/16")
        | search
            [| inputlookup FPT-Ransomware-IPv4 | rename value as src_ip | fields src_ip]
        | bucket _time span=1h
        | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium" 
        | stats values(proto) as Protocol_Number values(src_user) as Source_User, values(action) as action, values(attack) as Attack_Info count by Alert_Severity Time src_ip dest_ip
        | rename src_ip as src_ip dest_ip as dest_ip
        | fillnull value=N/A Protocol_Number Dest_IP Source_User Action Attack_Info