title: Posible SCAN Telnet Port (23) Per Host
id: d8ef70ed-4e5d-4af0-aa03-7ab3a6790d3d
status: test
description: Detects multiple connection attempts to Telnet port (23) from a single source IP address, indicating a possible port scan activity.
references:
    - https://www.checkpoint.com/
    - Internal: Hao
author: AnhPT127
date: 2026-02-10
modified: 2026-02-10
tags:
    - attack.t1046
    - attack.network_scanning
logsource:
    category: firewall
    product: checkpoint
    service: traffic
detection:
# xử lý sau
    selection:
        dest_port: 23
    condition: selection
falsepositives:
    - Legitimate network scanning activities
level: medium

x_splunk_es:
    targets:
        index: firewall
        sourcetype: traffic
        schedule_cron: "0 * * * *"
        earliest: "-1h"
        latest: "now"
        notable: { enabled: true, severity: medium, risk_score: 30 }
    search_query: |
        	index=* sourcetype=cp_log (tag=network OR tag=communicate) dest_port=23 (dest_ip="10.0.0.0/8" OR dest_ip="172.16.0.0/12" OR dest_ip="192.168.0.0/16") NOT src_ip="10.14.128.10"
            | bucket _time span=1h
            | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) AS Time | eval Alert_Severity="Medium"  
            | stats values(sourcetype) as "Source Type" values(action) as action dc(dest_ip) as Total_dest values(dest_port) as dest_port count by Alert_Severity Time src dest_ip
            | rename src as src_ip
            | where count > 100