artifact_schema_version: 1.0
artifact_type: tenant_rule
id: 77f0e02f-ee74-45ab-8e02-921246687a12
tenant_id: demo
siem_id: splunk
source_rule:
  rule_id: 77f0e02f-ee74-45ab-8e02-921246687a12
  rule_name: null
  rule_type: analyst
  source_path: rules/analysts/network/firewall/base/net_fw_possible_scan_ftp_port_21_external_allowed.yaml
  status: stable
  level: high
  version: 1.0.0
display_name: checkpoint-fw - Possible scan on FTP port 21 (external allowed)
metadata:
  tags:
  - attack.discovery
  - attack.t1046
  owner: AnhPT127
  last_rendered: '2026-03-31T07:15:35Z'
x_splunk_es:
  targets:
    ingest_targets:
    - device_id: checkpoint-fw
      dataset_id: traffic
      index: checkpoint
      sourcetype: cp_log
    device_id: checkpoint-fw
    dataset_id: traffic
    index: checkpoint
    sourcetype: cp_log
    schedule_cron: '*/30 * * * *'
    earliest: -30m
    latest: now
    notable:
      enabled: true
      severity: high
      risk_score: 60
    enabled: true
  search_query: |-
    ((index=checkpoint sourcetype=cp_log)) action!=blocked dest_port=21 NOT (src_ip=10.0.0.0/8 OR src_ip=192.168.0.0/16 OR src_ip=172.16.0.0/12)
    | bucket _time span=1h
    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) AS Time
    | eval Alert_Severity="High"
    | stats values(action) as Action, values(dest_ip) as "Dest IP", values(dest_port) as "Dest Port" count by Alert_Severity Time src_ip
    | sort - count
