title: FPT - Antivirus Ransomware Detected by AV
id: 5619b520-10d0-5da0-8125-013c35531371
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Antivirus Ransomware Detected by AV'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: critical
x_splunk_es:
  targets: {}
  search_query: "index=* (sourcetype=*mcafee* OR sourcetype=*eset*) signature IN (\"*BlackWorm*\", \"*Chaos*\", \"*Cobra*\", \"*ContiCrypt*\", \"*Crypter*\", \"*CRYPTES*\", \"*Cryptor*\", \"*CylanCrypt*\", \"*DelShad*\", \"*Destructor*\", \"*Filecoder*\", \"*GandCrab*\", \"*GrandCrab*\", \"*Haperlock*\", \"*Hiddentear*\", \"*HydraCrypt*\", \"*Krypt*\", \"*Lockbit*\", \"*Locker*\", \"*Mallox*\", \"*Phobos*\", \"*Ransom*\", \"*Ryuk*\", \"*Ryzerlo*\", \"*Stopcrypt*\", \"*Tescrypt*\", \"*TeslaCrypt*\", \"*WannaCry*\", \"*Xorist*\")\n| convert timeformat=\"%Y-%m-%d %H:%M:00\" ctime(_time) as Time | eval Alert_Severity=\"Critical\" \n| stats values(file_name) as File_Name values(file_path) as File_Path values(file_hash) as File_Hash values(hostname) as Host_Name values(ipv4) as ipv4 values(user) as User values(action_taken) as Action_taken count by Alert_Severity Time signature"

