title: FPT - Brute Force Attack On PAM
id: 29776941-d6de-5a96-9d9e-a1ada71993ad
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Brute Force Attack On PAM'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=cyberark (act=\"Undefined User Logon\" OR act=\"User Authentication\")\n| rename act as \"Event Name\", shost as \"Source IP\", cs5 as \"Destination IP\", suser as \"Username\"\n| eval Alert_Severity=\"High\"  \n| stats values(Event Name) as Signature earliest(_time) as First, latest(_time) as Last count by Alert_Severity \"Source IP\", \"Destination IP\", \"Username\"\n| eval First=strftime(First,\"%+\") \n| eval Last=strftime(Last,\"%+\")\n| where count >= 3"

