title: FPT - Cross Site Scripting (XSS) Detected
id: cb35ce97-d654-5c94-a0f5-17cd77462974
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Cross Site Scripting (XSS) Detected'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" (\"=<script>\" OR \"=%3Cscript%3E\" OR \"=%253Cscript%253E\" OR \"<iframe \" OR \"%3Ciframe \" OR \"<svg \" OR \"%3Csvg \" OR \"document.cookie\" OR \"document.domain\" OR \" onerror=\" OR \" onresize=\" OR \" onload=\\\"\" OR \"onmouseover=\" OR \"${alert\" OR \"javascript:alert\" OR \"javascript%3Aalert\") NOT (Status_Code=\"404\") NOT (src_ip=\"10.14.131.3\")\n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"High\" \n|  stats values(client_ip) as client_ip, values(src_ip) as src_ip_Limit_5_Lines , values(dest_ip) as dest_ip , values(dest_port) as dest_port , values(http_referrer) as http_referrer , values(http_user_agent) as http_user_agent_Limit_5_Lines , values(vendor_product) as vendor_product , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server , values(Status_Code) as Status_Code\
    \ , values(uri_path) as uri_path_(Limit_10_Lines) , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity Time http_x_forwarded_for\n|  eval http_user_agent_Limit_5_Lines=mvindex(http_user_agent_Limit_5_Lines,0,4)\n|  eval src_ip_Limit_5_Lines=mvindex(src_ip_Limit_5_Lines,0,4)\n|  eval uri_path_Limit_10_Lines=mvindex(uri_path_Limit_10_Lines,0,9)\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"

