title: FPT - Cyble Security Alerts
id: 61b29b83-1a02-58cd-85f9-3c9c5d927a9b
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Cyble Security Alerts'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: 'index=cyble_alerts source="Alerts://Cyble_alerts"

    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) as Time

    | stats values(severity) as Alert_Severity, values(status) as Status, values(keyword_name) as Keyword_Name, values(service_name) as Service_Name, values(ip{}) as IP_Address count by Time title

    | rename title as Cyble_Alert_Title'

