title: FPT - Detect Network Attacks By AV HIPS Last 7 Days
id: cacfd02f-c3a0-5964-b19c-51290ac6a004
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Detect Network Attacks By AV HIPS Last 7 Days'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: 'index=* sourcetype=*eset* event_type=FirewallAggregated_Event threat_name!="*RDP*"

    |  bucket _time span=1d

    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) as Time

    | eval Alert_Severity="High"

    |  stats earliest("occured") as Start_Time latest("occured") as End_Time values(target_address) as target_address, values(hostname) as hostname, values(target_port) as target_port, values(protocol) as protocol, values(event) as event, values(threat_name) as threat_name, values(action) as action count by Alert_Severity Time source_address

    |  eval target_port=mvindex(target_port,0,9)

    |  eval target_address=mvindex(target_address,0,9)

    |  rename hostname as "target_hostname"

    |  sort - count

    |  where count > 150'

