title: FPT - ESET - Antivirus Relevant File Paths Alerts
id: 07c0b87e-2a9b-5a41-825b-f158057b1a9a
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - ESET - Antivirus Relevant File Paths Alerts'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=epav sourcetype=\"eset:ra\" file_path IN (\"*:\\\\PerfLogs\\\\*\", \"*:\\\\Temp\\\\*\", \"*:\\\\Users\\\\Default\\\\*\", \"*:\\\\Users\\\\Public\\\\*\", \"*:\\\\Windows\\\\*\", \"*/www/*\", \"*\\\\inetpub\\\\*\", \"*\\\\tsclient\\\\*\", \"*apache*\", \"*nginx*\", \"*tomcat*\", \"*weblogic*\") OR file_path IN (\"*.asax\", \"*.ashx\", \"*.asmx\", \"*.asp\", \"*.aspx\", \"*.bat\", \"*.cfm\", \"*.cgi\", \"*.chm\", \"*.cmd\", \"*.dat\", \"*.ear\", \"*.gif\", \"*.hta\", \"*.jpeg\", \"*.jpg\", \"*.jsp\", \"*.jspx\", \"*.lnk\", \"*.msc\", \"*.php\", \"*.pl\", \"*.png\", \"*.ps1\", \"*.psm1\", \"*.py\", \"*.pyc\", \"*.rb\", \"*.scf\", \"*.sct\", \"*.sh\", \"*.svg\", \"*.txt\", \"*.vbe\", \"*.vbs\", \"*.war\", \"*.wll\", \"*.wsf\", \"*.wsh\", \"*.xll\", \"*.xml\")\n| bucket _time span=15m\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time \n| eval Alert_Severity=\"High\"\n| stats values(index) as Index,values(action) as Action, values(action_taken) as AV_Action_Taken,\
    \ values(group_name) as group_name, values(dest) as dest, values(file_name) as file_name_Limit_10_Lines, values(file_path) as file_path_Limit_10_Lines, values(file_hash) as file_hash_Limit_10_Lines, values(hostname) as hostname, values(os_name) as os_name, values(processname) as Process_Name, values(threat_name) as threat_name_Limit_10_Lines, values(user) as user count by Alert_Severity Time ipv4\n| eval file_name_Limit_10_Lines=mvindex(file_name_Limit_10_Lines,0,9)\n| eval file_path_Limit_10_Lines=mvindex(file_path_Limit_10_Lines,0,9)\n| eval file_hash_Limit_10_Lines=mvindex(file_hash_Limit_10_Lines,0,9)\n| eval threat_name_Limit_10_Lines=mvindex(threat_name_Limit_10_Lines,0,9)\n| fillnull value=N/A AV_Action_Taken Process_Name user"

