title: FPT - ESET - Password Dumper Detected on AZINSU Servers
id: 754117ef-09c9-5239-a066-888dca491b30
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - ESET - Password Dumper Detected on AZINSU Servers'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=epav sourcetype=\"eset:ra\" threat_name=\"PWS*\" OR threat_name IN  (\"*Certify*\", \"*DCSync*\", \"*DumpCreds*\", \"*DumpLsass*\", \"*DumpPert*\", \"*HTool/WCE*\", \"*Kekeo*\", \"*Lazagne*\", \"*LsassDump*\", \"*Mimikatz*\", \"*MultiDump*\", \"*Nanodump*\", \"*NativeDump*\", \"*Outflank*\", \"*PShlSpy*\", \"*PSWTool*\", \"*PWCrack*\", \"*PWDump*\", \"*PWS.*\", \"*PWSX*\", \"*pypykatz*\", \"*Rubeus*\", \"*SafetyKatz*\", \"*SecurityTool*\", \"*SharpChrome*\", \"*SharpDPAPI*\", \"*SharpDump*\", \"*SharpKatz*\", \"*SharpS.*\", \"*ShpKatz*\", \"*TrickDump*\")\n(ipv4=10.86.224.24 OR ipv4=10.14.190.28 OR ipv4=10.14.141.117 OR ipv4=10.14.141.121 OR ipv4=10.86.224.21 OR ipv4=10.86.224.22 OR ipv4=10.86.222.52)\n| bucket _time span=15m\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time \n| eval Alert_Severity=\"High\"\n| stats values(index) as Index,values(action) as Action, values(action_taken) as AV_Action_Taken, values(group_name) as group_name, values(dest)\
    \ as dest, values(file_name) as file_name, values(file_path) as file_path, values(file_hash) as file_hash, values(hostname) as hostname, values(os_name) as os_name, values(processname) as Process_Name, values(threat_name) as threat_name, values(user) as user count by Alert_Severity Time ipv4\n| fillnull value=N/A AV_Action_Taken file_name file_path file_hash Process_Name user"

