title: FPT - ESET - Antivirus Web Shell Detection
id: 2c36f8cf-e577-54bb-b306-2c3c8d5168c0
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - ESET - Antivirus Web Shell Detection'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=epav sourcetype=\"eset:ra\" threat_name IN (\"ASP.*\", \"IIS/BackDoor*\", \"JAVA/Backdoor*\", \"JSP.*\", \"Perl.*\", \"PHP.*\", \"Troj/ASP*\", \"Troj/JSP*\", \"Troj/PHP*\", \"VBS/Uxor*\") OR threat_name IN (\"*ASP_*\", \"*ASP:*\", \"*ASP.Agent*\", \"*ASP/*\", \"*Aspdoor*\", \"*ASPXSpy*\", \"*Backdoor.ASP*\", \"*Backdoor.Java*\", \"*Backdoor.JSP*\", \"*Backdoor.PHP*\", \"*Backdoor.VBS*\", \"*Backdoor/ASP*\", \"*Backdoor/Java*\", \"*Backdoor/JSP*\", \"*Backdoor/PHP*\", \"*Backdoor/VBS*\", \"*C99shell*\", \"*Chopper*\", \"*filebrowser*\", \"*JSP_*\", \"*JSP:*\", \"*JSP.Agent*\", \"*JSP/*\", \"*Perl:*\", \"*Perl/*\", \"*PHP_*\", \"*PHP:*\", \"*PHP.Agent*\", \"*PHP/*\", \"*PHPShell*\", \"*PShlSpy*\", \"*SinoChoper*\", \"*Trojan.ASP*\", \"*Trojan.JSP*\", \"*Trojan.PHP*\", \"*Trojan.VBS*\", \"*VBS.Agent*\", \"*VBS/Agent*\", \"*Webshell*\")\n| bucket _time span=15m\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time \n| eval Alert_Severity=\"High\"\n| stats values(index)\
    \ as Index,values(action) as Action, values(action_taken) as AV_Action_Taken, values(group_name) as group_name, values(dest) as dest, values(file_name) as file_name, values(file_path) as file_path, values(file_hash) as file_hash, values(hostname) as hostname, values(os_name) as os_name, values(processname) as Process_Name, values(threat_name) as threat_name, values(user) as user count by Alert_Severity Time ipv4\n| fillnull value=N/A AV_Action_Taken file_name file_path file_hash Process_Name user"

