title: FPT - ESXi Unusual SSH enable behavior
id: 4b77fd0e-0bb9-5a53-bf44-89fbdbb03601
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - ESXi Unusual SSH enable behavior'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: critical
x_splunk_es:
  targets: {}
  search_query: "index=ESXi sourcetype=* \"SSH\" \"enabled\"\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"Critical\" \n| stats count by Alert_Severity Time user host details"

