title: FPT - IOC Cyble Detected - Inbound IPv4 by Fortinet
id: 1b42ba36-e18a-5bd6-98ae-f651b3f7c85b
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - IOC Cyble Detected - Inbound IPv4 by Fortinet'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=main sourcetype=fortinet\n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time \n| search \n    [| inputlookup ioc_cyble_ipv4_src.csv] ```Input CSV triggred from alert \"Input Lookup - IOC Cyble (Source IPv4)\"```\n| eval Alert_Severity=\"Medium\"\n| stats values(index) as Index values(action) as Action values(dst) as dest_ip dc(dst) as Total_dest values(dstport) as \"Dest Port\" count by Alert_Severity Time src\n| where count >= 100"

