title: FPT - IOC Cyble Detected - Outbound IPv4 by Fortinet
id: 33ed5234-b0d1-56fd-88fe-51aa8d7964ec
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - IOC Cyble Detected - Outbound IPv4 by Fortinet'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=main sourcetype=fortinet action=accept\n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time \n| search \n    [| inputlookup ioc_cyble_ipv4_dst.csv] ```Input CSV triggred from alert \"Input Lookup - IOC Cyble (Dest IPv4)\"```\n| eval Alert_Severity=\"Medium\"\n| stats values(index) as Index values(action) as Action values(src) as src_ip values(dstport) as \"Dest Port\" count by Alert_Severity Time dst\n| where count >= 20"

