title: FPT - Maltrail Domain Query Detection
id: 29358bb5-e052-557b-a66c-af704b2afb39
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Maltrail Domain Query Detection'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=netdns AND sourcetype=MSAD:NT6:DNS questionname=* direction=Snd (src_ip=\"10.0.0.0/8\" OR src_ip=\"172.16.0.0/12\" OR src_ip=\"192.168.0.0/16\") \nNOT (src_ip=1.1.1.1 OR src_ip=8.8.8.8 OR src_ip=10.15.30.254 OR src_ip=10.15.16.68 OR src_ip=10.15.16.65 OR src_ip=10.15.16.69 OR src_ip=10.15.16.70 OR src_ip=10.1.1.13 OR src_ip=10.1.1.54 OR src_ip=10.1.1.51) action=success\n| eval questionname=replace(questionname,\"(\\(\\d+)\\)\",\".\") \n| eval questionname=replace(questionname,\"^.\",\"\") \n| eval questionname=replace(questionname,\".$\",\"\")\n| bucket _time span=30m\n| search \n    [| inputlookup maltrail_domain.csv]\n| convert timeformat=\"%m/%d/%Y %H:%M:%S\" ctime(_time) AS Time\n| eval Alert_Severity=\"Medium\"\n| stats values(questionname) as Domain_Name values(action) as Action count by Alert_Severity Time src_ip"

