title: FPT - Multiple Failed Password on Linux
id: da25f212-5f1a-5bfe-91c8-57676ce9c57b
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Multiple Failed Password on Linux'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: 'index=* sourcetype=linux_syslog "Failed password"

    | bucket _time span=1h

    | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(_time) AS Time

    | eval Alert_Severity="Medium"

    | stats values(srcip) as srcip count by Alert_Severity Time user host

    | where count>=5'

