title: FPT - Network Communication With Crypto Mining Pool
id: 0868403a-2859-5b81-9b1f-e9ced9bfdf78
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Network Communication With Crypto Mining Pool'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=netdns AND sourcetype=MSAD:NT6:DNS questionname=* NOT (src_ip=8.8.8.8 OR src_ip=10.15.30.254 OR src_ip=10.15.16.68 OR src_ip=10.15.16.65 OR src_ip=10.15.16.69 OR src_ip=10.15.16.70 OR src_ip=10.1.1.13 OR src_ip=10.1.1.54 OR src_ip=10.1.1.51 OR src_ip=1.1.1.1 OR src_ip=10.14.132.16 OR src_ip=10.15.6.11 OR src_ip=10.225.6.52 OR src_ip=4.2.2.2)\n| convert timeformat=\"%m/%d/%Y %H:00:00\" ctime(_time) AS Time\n| eval Alert_Severity=\"Medium\"\n| eval questionname=replace(questionname,\"(\\(\\d+)\\)\",\".\") \n| eval questionname=replace(questionname,\"^.\",\"\") \n| eval questionname=replace(questionname,\".$\",\"\")\n| search (questionname = \"alimabi.cn\" OR questionname = \"ap.luckpool.net\" OR questionname = \"bcn.pool.minergate.com\" OR questionname = \"bcn.vip.pool.minergate.com\" OR questionname = \"bohemianpool.com\" OR questionname = \"ca-aipg.miningocean.org\" OR questionname = \"ca-dynex.miningocean.org\" OR questionname = \"ca-neurai.miningocean.org\" OR questionname\
    \ = \"ca-qrl.miningocean.org\" OR questionname = \"ca-upx.miningocean.org\" OR questionname = \"ca-zephyr.miningocean.org\" OR questionname = \"ca.minexmr.com\" OR questionname = \"ca.monero.herominers.com\" OR questionname = \"cbd.monerpool.org\" OR questionname = \"cbdv2.monerpool.org\" OR questionname = \"cryptmonero.com\" OR questionname = \"crypto-pool.fr\" OR questionname = \"crypto-pool.info\" OR questionname = \"cryptonight-hub.miningpoolhub.com\" OR questionname = \"d1pool.ddns.net\" OR questionname = \"d5pool.us\" OR questionname = \"daili01.monerpool.org\" OR questionname = \"de-aipg.miningocean.org\" OR questionname = \"de-dynex.miningocean.org\" OR questionname = \"de-zephyr.miningocean.org\" OR questionname = \"de.minexmr.com\" OR questionname = \"dl.nbminer.com\" OR questionname = \"donate.graef.in\" OR questionname = \"donate.ssl.xmrig.com\" OR questionname = \"donate.v2.xmrig.com\" OR questionname = \"donate.xmrig.com\" OR questionname = \"donate2.graef.in\" OR questionname\
    \ = \"drill.moneroworld.com\" OR questionname = \"dwarfpool.com\" OR questionname = \"emercoin.com\" OR questionname = \"emercoin.net\" OR questionname = \"emergate.net\" OR questionname = \"ethereumpool.co\" OR questionname = \"eu.luckpool.net\" OR questionname = \"eu.minerpool.pw\" OR questionname = \"fcn-xmr.pool.minergate.com\" OR questionname = \"fee.xmrig.com\" OR questionname = \"fr-aipg.miningocean.org\" OR questionname = \"fr-dynex.miningocean.org\" OR questionname = \"fr-neurai.miningocean.org\" OR questionname = \"fr-qrl.miningocean.org\" OR questionname = \"fr-upx.miningocean.org\" OR questionname = \"fr-zephyr.miningocean.org\" OR questionname = \"fr.minexmr.com\" OR questionname = \"hellominer.com\" OR questionname = \"herominers.com\" OR questionname = \"hk-aipg.miningocean.org\" OR questionname = \"hk-dynex.miningocean.org\" OR questionname = \"hk-neurai.miningocean.org\" OR questionname = \"hk-qrl.miningocean.org\" OR questionname = \"hk-upx.miningocean.org\" OR questionname\
    \ = \"hk-zephyr.miningocean.org\" OR questionname = \"huadong1-aeon.ppxxmr.com\" OR questionname = \"iwanttoearn.money\" OR questionname = \"jw-js1.ppxxmr.com\" OR questionname = \"koto-pool.work\" OR questionname = \"lhr.nbminer.com\" OR questionname = \"lhr3.nbminer.com\" OR questionname = \"linux.monerpool.org\" OR questionname = \"lokiturtle.herominers.com\" OR questionname = \"luckpool.net\" OR questionname = \"masari.miner.rocks\" OR questionname = \"mine.c3pool.com\" OR questionname = \"mine.moneropool.com\" OR questionname = \"mine.ppxxmr.com\" OR questionname = \"mine.zpool.ca\" OR questionname = \"mine1.ppxxmr.com\" OR questionname = \"minemonero.gq\" OR questionname = \"miner.ppxxmr.com\" OR questionname = \"miner.rocks\" OR questionname = \"minercircle.com\" OR questionname = \"minergate.com\" OR questionname = \"minerpool.pw\" OR questionname = \"minerrocks.com\" OR questionname = \"miners.pro\" OR questionname = \"minerxmr.ru\" OR questionname = \"minexmr.cn\" OR questionname\
    \ = \"minexmr.com\" OR questionname = \"mining-help.ru\" OR questionname = \"miningpoolhub.com\" OR questionname = \"mixpools.org\" OR questionname = \"moner.monerpool.org\" OR questionname = \"moner1min.monerpool.org\" OR questionname = \"monero-master.crypto-pool.fr\" OR questionname = \"monero.crypto-pool.fr\" OR questionname = \"monero.hashvault.pro\" OR questionname = \"monero.herominers.com\" OR questionname = \"monero.lindon-pool.win\" OR questionname = \"monero.miners.pro\" OR questionname = \"monero.riefly.id\" OR questionname = \"monero.us.to\" OR questionname = \"monerocean.stream\" OR questionname = \"monerogb.com\" OR questionname = \"monerohash.com\" OR questionname = \"moneroocean.stream\" OR questionname = \"moneropool.com\" OR questionname = \"moneropool.nl\" OR questionname = \"monerorx.com\" OR questionname = \"monerpool.org\" OR questionname = \"moriaxmr.com\" OR questionname = \"mro.pool.minergate.com\" OR questionname = \"multipool.us\" OR questionname = \"myxmr.pw\"\
    \ OR questionname = \"na.luckpool.net\" OR questionname = \"nanopool.org\" OR questionname = \"nbminer.com\" OR questionname = \"node3.luckpool.net\" OR questionname = \"noobxmr.com\" OR questionname = \"pangolinminer.comgandalph3000.com\" OR questionname = \"pool.4i7i.com\" OR questionname = \"pool.armornetwork.org\" OR questionname = \"pool.cortins.tk\" OR questionname = \"pool.gntl.co.uk\" OR questionname = \"pool.hashvault.pro\" OR questionname = \"pool.minergate.com\" OR questionname = \"pool.minexmr.com\" OR questionname = \"pool.monero.hashvault.pro\" OR questionname = \"pool.ppxxmr.com\" OR questionname = \"pool.somec.cc\" OR questionname = \"pool.support\" OR questionname = \"pool.supportxmr.com\" OR questionname = \"pool.usa-138.com\" OR questionname = \"pool.xmr.pt\" OR questionname = \"pool.xmrfast.com\" OR questionname = \"pool2.armornetwork.org\" OR questionname = \"poolchange.ppxxmr.com\" OR questionname = \"pooldd.com\" OR questionname = \"poolmining.org\" OR questionname\
    \ = \"poolto.be\" OR questionname = \"ppxvip1.ppxxmr.com\" OR questionname = \"ppxxmr.com\" OR questionname = \"prohash.net\" OR questionname = \"r.twotouchauthentication.online\" OR questionname = \"randomx.xmrig.com\" OR questionname = \"ratchetmining.com\" OR questionname = \"seed.emercoin.com\" OR questionname = \"seed.emercoin.net\" OR questionname = \"seed.emergate.net\" OR questionname = \"seed1.joulecoin.org\" OR questionname = \"seed2.joulecoin.org\" OR questionname = \"seed3.joulecoin.org\" OR questionname = \"seed4.joulecoin.org\" OR questionname = \"seed5.joulecoin.org\" OR questionname = \"seed6.joulecoin.org\" OR questionname = \"seed7.joulecoin.org\" OR questionname = \"seed8.joulecoin.org\" OR questionname = \"sg-aipg.miningocean.org\" OR questionname = \"sg-dynex.miningocean.org\" OR questionname = \"sg-neurai.miningocean.org\" OR questionname = \"sg-qrl.miningocean.org\" OR questionname = \"sg-upx.miningocean.org\" OR questionname = \"sg-zephyr.miningocean.org\" OR\
    \ questionname = \"sg.minexmr.com\" OR questionname = \"sheepman.mine.bz\" OR questionname = \"siamining.com\" OR questionname = \"sumokoin.minerrocks.com\" OR questionname = \"supportxmr.com\" OR questionname = \"suprnova.cc\" OR questionname = \"teracycle.net\" OR questionname = \"trtl.cnpool.cc\" OR questionname = \"trtl.pool.mine2gether.com\" OR questionname = \"turtle.miner.rocks\" OR questionname = \"us-aipg.miningocean.org\" OR questionname = \"us-dynex.miningocean.org\" OR questionname = \"us-neurai.miningocean.org\" OR questionname = \"us-west.minexmr.com\" OR questionname = \"us-zephyr.miningocean.org\" OR questionname = \"usxmrpool.com\" OR questionname = \"viaxmr.com\" OR questionname = \"webservicepag.webhop.net\" OR questionname = \"xiazai.monerpool.org\" OR questionname = \"xiazai1.monerpool.org\" OR questionname = \"xmc.pool.minergate.com\" OR questionname = \"xmo.pool.minergate.com\" OR questionname = \"xmr-asia1.nanopool.org\" OR questionname = \"xmr-au1.nanopool.org\"\
    \ OR questionname = \"xmr-eu1.nanopool.org\" OR questionname = \"xmr-eu2.nanopool.org\" OR questionname = \"xmr-jp1.nanopool.org\" OR questionname = \"xmr-us-east1.nanopool.org\" OR questionname = \"xmr-us-west1.nanopool.org\" OR questionname = \"xmr-us.suprnova.cc\" OR questionname = \"xmr-usa.dwarfpool.com\" OR questionname = \"xmr.2miners.com\" OR questionname = \"xmr.5b6b7b.ru\" OR questionname = \"xmr.alimabi.cn\" OR questionname = \"xmr.bohemianpool.com\" OR questionname = \"xmr.crypto-pool.fr\" OR questionname = \"xmr.crypto-pool.info\" OR questionname = \"xmr.f2pool.com\" OR questionname = \"xmr.hashcity.org\" OR questionname = \"xmr.hex7e4.ru\" OR questionname = \"xmr.ip28.net\" OR questionname = \"xmr.monerpool.org\" OR questionname = \"xmr.mypool.online\" OR questionname = \"xmr.nanopool.org\" OR questionname = \"xmr.pool.gntl.co.uk\" OR questionname = \"xmr.pool.minergate.com\" OR questionname = \"xmr.poolto.be\" OR questionname = \"xmr.ppxxmr.com\" OR questionname = \"xmr.prohash.net\"\
    \ OR questionname = \"xmr.simka.pw\" OR questionname = \"xmr.somec.cc\" OR questionname = \"xmr.suprnova.cc\" OR questionname = \"xmr.usa-138.com\" OR questionname = \"xmr.vip.pool.minergate.com\" OR questionname = \"xmr1min.monerpool.org\" OR questionname = \"xmrf.520fjh.org\" OR questionname = \"xmrf.fjhan.club\" OR questionname = \"xmrfast.com\" OR questionname = \"xmrigcc.graef.in\" OR questionname = \"xmrminer.cc\" OR questionname = \"xmrpool.de\" OR questionname = \"xmrpool.eu\" OR questionname = \"xmrpool.me\" OR questionname = \"xmrpool.net\" OR questionname = \"xmrpool.xyz\" OR questionname = \"xx11m.monerpool.org\" OR questionname = \"xx11mv2.monerpool.org\" OR questionname = \"xxx.hex7e4.ru\" OR questionname = \"zarabotaibitok.ru\" OR questionname = \"zer0day.ru\")\n| stats values(questionname) as Domain_Name values(action) as Action count by Time Alert_Severity src_ip"

