title: FPT - No Log from RP.LAB over 4 hours
id: 90c71e55-83ee-5bfc-ac43-2c0197252be4
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - No Log from RP.LAB over 4 hours'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "| tstats count where index=* by _time sourcetype host source\n| eventstats latest(_time) as latest_Time_host by host\n| eventstats latest(_time) as latest_Time_all\n| eval conditions=latest_Time_all - latest_Time_host\n| eval Status=if(conditions>=14400,\"Missing Data!\",\"OK!\")\n| eval Alert_Severity=\"Medium\"\n| stats values(Status) as Status values(conditions) as conditions values(latest_Time_host) as latest_Time_host values(latest_Time_all) as latest_Time_all by Alert_Severity host sourcetype source\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(latest_Time_host) as latest_Time_host  ctime(latest_Time_all) as latest_Time_all \n| search host=\"RP.lab\" Status=\"Missing Data!\""

