title: FPT - No Log from Host over 24 hours
id: 655aae83-ffb9-5d48-844e-5efcaa172bd1
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - No Log from Host over 24 hours'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: '| tstats count where index=* by _time host

    | eventstats latest(_time) as latest_Time_host by host

    | eventstats latest(_time) as latest_Time_all

    | eval conditions=latest_Time_all - latest_Time_host

    | eval Status=if(conditions>=86400,"Missing Data!","OK!")

    | eval Alert_Severity="Medium"

    | stats values(Status) as Status values(conditions) as Lost_Time_(Seconds) values(latest_Time_host) as Last_seen_on_Host values(latest_Time_all) as Real_Time by Alert_Severity host

    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(Last_seen_on_Host) as Last_seen_on_Host,  ctime(Real_Time) as Real_Time, ctime(''Lost_Time_(Seconds)'') as Lost_Time_(Seconds)

    | search Status="Missing Data!" NOT (`filter_host_separate_monitoring`)'

