title: FPT - No Log from SVN over 24 hour
id: 8b983e20-65cb-51fe-b436-091238422c97
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - No Log from SVN over 24 hour'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "| tstats count where index=* by _time host\n| eventstats latest(_time) as latest_Time_host by host\n| eventstats latest(_time) as latest_Time_all\n| eval conditions=latest_Time_all - latest_Time_host\n| eval Status=if(conditions>=86400,\"Missing Data!\",\"OK!\")\n| eval Alert_Severity=\"Medium\"\n| stats values(Status) as Status values(conditions) as conditions values(latest_Time_host) as Latest_Time_on_host values(latest_Time_all) as Current_Time by Alert_Severity host \n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(Latest_Time_on_host) as Latest_Time_on_host  ctime(Current_Time) as Current_Time\n| search (host=\"HCM-REPSVN\" OR host=\"HN-REPSVN\" OR host=\"LABSVN-HN\" OR host=\"LABHCM-SVN\") Status=\"Missing Data!\""

