title: FPT - No Log from ESXi/vCenter host over 1 hour
id: 41a010cd-f780-58bb-bfef-eeeb31700926
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - No Log from ESXi/vCenter host over 1 hour'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "| tstats count where index=* by _time sourcetype host\n| eventstats latest(_time) as latest_Time_host by host\n| eventstats latest(_time) as latest_Time_all\n| eval conditions=latest_Time_all - latest_Time_host\n| eval Status=if(conditions>=3600,\"Missing Data!\",\"OK!\")\n| eval Alert_Severity=\"Medium\"\n| stats values(Status) as Status values(conditions) as \"Lost_Time (Seconds)\" values(latest_Time_host) as Latest_Time_on_host values(latest_Time_all) as Current_Time by Alert_Severity host \n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(Latest_Time_on_host) as Latest_Time_on_host  ctime(Current_Time) as Current_Time \n| search (host=\"10.15.31.11\" OR host=\"10.15.31.12\" OR host=\"10.15.31.13\" OR host=\"10.14.60.101\" OR host=\"10.14.60.102\" OR host=\"10.14.60.103\" OR host=\"10.14.60.104\" OR host=\"10.14.60.105\" OR host=\"10.14.60.106\" OR host=\"10.14.60.107\" OR host=\"10.14.60.108\" OR host=\"10.14.60.109\" OR host=\"10.14.60.110\" OR host=\"10.14.60.111\"\
    \ OR host=\"10.14.60.112\" OR host=\"10.14.60.113\" OR host=\"10.14.60.115\" OR host=\"10.14.60.114\" OR host=\"10.14.60.116\" OR host=\"10.14.60.117\" OR host=\"10.14.60.118\" OR host=\"10.14.60.119\" OR host=\"10.14.60.120\" OR host=\"10.14.60.121\" OR host=\"10.14.60.122\" OR host=\"10.14.60.123\" OR host=\"10.14.60.124\" OR host=\"10.14.60.125\" OR host=\"10.14.60.126\" OR host=\"10.14.60.127\" OR host=\"10.14.60.128\" OR host=\"10.14.60.129\" OR host=\"10.14.60.130\" OR host=\"10.14.60.171\" OR host=\"10.14.60.172\" OR host=\"10.15.31.14\" OR host=\"10.14.60.100\") Status=\"Missing Data!\""

