title: FPT - No Log from GIT LAB over 1 hour
id: 98b42637-a0c6-5e98-8163-c49190c3901b
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - No Log from GIT LAB over 1 hour'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "| tstats count where index=* by _time sourcetype host\n| eventstats latest(_time) as latest_Time_host by host\n| eventstats latest(_time) as latest_Time_all\n| eval conditions=latest_Time_all - latest_Time_host\n| eval Status=if(conditions>=3600,\"Missing Data!\",\"OK!\")\n| eval Alert_Severity=\"Medium\"\n| stats values(Status) as Status values(conditions) as conditions values(latest_Time_host) as Latest_Time_on_host values(latest_Time_all) as Current_Time by Alert_Severity host \n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(Latest_Time_on_host) as Latest_Time_on_host  ctime(Current_Time) as Current_Time \n| search host=GIT-LAB Status=\"Missing Data!\""

