title: FPT - Possible Webshell Creation In Microsoft Exchange Directories - WinEvent
id: a467734e-6a9c-5421-a975-82960252d935
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Possible Webshell Creation In Microsoft Exchange Directories - WinEvent'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: critical
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"*WinEvent*\" EventID=4663 ((ObjectName=\"*.aspx\" OR ObjectName=\"*.asp\" OR ObjectName=\"*.ashx\" OR ObjectName=\"*.ps1\" OR ObjectName=\"*.bat\" OR ObjectName=\"*.exe\" OR ObjectName=\"*.dll\" OR ObjectName=\"*.vbs\" OR ObjectName=\"*.req\") (((ObjectName=\"*wwwroot*\") (ObjectName=\"*aspnet_client*\") (ObjectName=\"*inetpub*\")) OR (((ObjectName=\"*Microsoft*\") (ObjectName=\"*Exchange*\") (ObjectName=\"*Server*\")) (((ObjectName=\"*ClientAccess*\") (ObjectName=\"*owa*\")) OR ((ObjectName=\"*FrontEnd*\") (ObjectName=\"*HttpProxy*\") (ObjectName=\"*owa*\"))))))\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"Critical\"  \n| stats values(status) as status values(ObjectName) as ObjectName values(process_name) as Process_Name values(signature) as Signature values(src_user) as src_user count by Alert_Severity Time Computer"

