title: FPT - SQL Injection Detected
id: dd63e285-bf76-54bf-b3a2-cf5692901fb0
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - SQL Injection Detected'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" (\"@@version\" OR \"%271%27%3D%271\" OR \"=select \" OR \"=select(\" OR \"=select%20\" OR \"concat_ws(\" OR \"CONCAT(0x\" OR \"from mysql.innodb_table_stats\" OR \"from%20mysql.innodb_table_stats\" OR \"group_concat(\" OR \"information_schema.tables\" OR \"json_arrayagg(\" OR \"or 1=1#\" OR \"or%201=1#\" OR \"order by \" OR \"order%20by%20\" OR \"select * \" OR \"select database()\" OR \"select version()\" OR \"select%20*%20\" OR \"select%20database()\" OR \"select%20version()\" OR \"select%28sleep%2810%29\" OR \"SELECTCHAR(\" OR \"table_schema\" OR \"UNION ALL SELECT\" OR \"UNION SELECT\" OR \"UNION%20ALL%20SELECT\" OR \"UNION%20SELECT\" OR \"'1'='1\") NOT (Status_Code=\"404\") NOT (src_ip=10.14.131.3 OR client_ip=10.14.131.3)\n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"High\" \n|  stats values(client_ip) as client_ip,\
    \ values(src_ip) as src_ip , values(dest_ip) as dest_ip , values(dest_port) as dest_port , values(http_referrer) as http_referrer , values(http_user_agent) as http_user_agent , values(http_x_forwarded_for) as http_x_forwarded_for , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server , values(Status_Code) as Status_Code , values(uri_path) as uri_path , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity Time vendor_product\n| eval src_ip=mvindex('src_ip',0,9)\n| eval client_ip=mvindex('client_ip',0,9)\n| eval Agent=mvindex('Agent',0,9)\n| eval uri_path=mvindex('uri_path',0,9)\n| eval uri_query=mvindex('uri_query',0,9)\n| eval URL=mvindex('URL',0,9)\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"

