title: FPT - Suspicious User Agent
id: 86cbc9d5-9632-568d-add3-dbbe4d2a9617
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Suspicious User Agent'
author: soc_monitor
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" ((((http_user_agent=\"user-agent*\" OR http_user_agent=\"Mozilla/3.0 *\" OR http_user_agent=\"Mozilla/2.0 *\" OR http_user_agent=\"Mozilla/1.0 *\" OR http_user_agent=\"Mozilla *\" OR http_user_agent=\" Mozilla/*\" OR http_user_agent=\"Mozila/*\" OR http_user_agent=\"Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol*\")) OR (http_user_agent=\"* (compatible;MSIE *\" OR http_user_agent=\"*.0;Windows NT *\" OR http_user_agent=\"*loader*\") OR (http_user_agent=\"_\" OR http_user_agent=\"CertUtil URL Agent\" OR http_user_agent=\"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)\" OR http_user_agent=\"Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0\" OR http_user_agent=\"HTTPS\" OR http_user_agent=\"Erbium-UA-4ce7c27cb4be9d32e333bf032c88235a\" OR http_user_agent=\"x\" OR http_user_agent=\"xxx\"))  OR (((Agent=\"user-agent*\" OR Agent=\"Mozilla/3.0 *\" OR\
    \ Agent=\"Mozilla/2.0 *\" OR Agent=\"Mozilla/1.0 *\" OR Agent=\"Mozilla *\" OR Agent=\" Mozilla/*\" OR Agent=\"Mozila/*\" OR Agent=\"Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol*\")) OR (Agent=\"* (compatible;MSIE *\" OR Agent=\"*.0;Windows NT *\" OR Agent=\"*loader*\") OR (Agent=\"_\" OR Agent=\"CertUtil URL Agent\" OR Agent=\"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)\" OR Agent=\"Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0\" OR Agent=\"HTTPS\" OR Agent=\"Erbium-UA-4ce7c27cb4be9d32e333bf032c88235a\" OR Agent=\"x\" OR Agent=\"xxx\"))) NOT (http_user_agent=\"Mozilla/3.0 * Acrobat *\" OR Agent=\"Mozilla/3.0 * Acrobat *\")\nNOT (src_ip=162.158.114.1* AND Status_Code=4*)\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time \n| eval Alert_Severity=\"Medium\"  \n|  stats latest(Time) as Time, values(src_ip) as src_ip , values(dest_ip) as dest_ip , values(dest_port) as dest_port , values(http_referrer) as http_referrer\
    \ , values(http_user_agent) as http_user_agent , values(http_x_forwarded_for) as http_x_forwarded_for , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server , values(Status_Code) as Status_Code , values(uri_path) as uri_path , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity client_ip vendor_product\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"

