title: FPT - Suspicious Connects to PAM Accept by Firewall
id: 261946f7-ea14-5efc-8b55-d7f56e523d1a
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Suspicious Connects to PAM Accept by Firewall'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "((index=main sourcetype=fortinet) OR (index=checkpoint sourcetype=cp_log)) NOT (srcip=10.14.51.55 OR srcip=10.14.51.56 OR srcip=\"10.86.133.252\" OR srcip=\"10.86.108.240\" OR srcip=10.15.225.54) dstip=\"10.14.124.28\" (proto=6 OR proto=17) action=accept\n| convert timeformat=\"%m/%d/%Y\" ctime(_time) as Time | eval Alert_Severity=\"High\" \n| stats values(dstip) as Dest_IP values(dstport) as Dest_Port count by Alert_Severity Time srcip action service proto\n| replace 6 with TCP, 17 with UDP in proto"

