title: FPT - Wannacry Killswitch Domain
id: 79af8ff7-6e44-5027-8fe3-20015dd2102c
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Wannacry Killswitch Domain'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* (sourcetype=cp_log OR sourcetype=forti*) (dst_domain_name=\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing\" OR dst_domain_name=\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test\" OR dst_domain_name=\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com\" OR dst_domain_name=\"ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com\" OR dst_domain_name=\"iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com\")\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time | eval Alert_Severity=\"Medium\"  \n| stats values(dest_ip) as Dest_IP values(dst_domain_name) as Dst_Domain_Name values(action) as Action values(sourcetype) as \"Source Type\" count by Alert_Severity Time src_ip"

