title: FPT - Windows Webshell Strings Detected
id: 237d0a43-3e41-52df-874b-2d319471a2fa
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - Windows Webshell Strings Detected'
author: soc_monitor
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" (Method=\"GET\" ((\"=whoami\" OR \"=net%20user\" OR \"=net+user\" OR \"=net%2Buser\" OR \"=cmd%20/c%\" OR \"=cmd+/c+\" OR \"=cmd%2B/c%\" OR \"=cmd%20/r%\" OR \"=cmd+/r+\" OR \"=cmd%2B/r%\" OR \"=cmd%20/k%\" OR \"=cmd+/k+\" OR \"=cmd%2B/k%\" OR \"=powershell%\" OR \"=powershell+\" OR \"=tasklist%\" OR \"=tasklist+\" OR \"=wmic%\" OR \"=wmic+\" OR \"=ssh%\" OR \"=ssh+\" OR \"=python%\" OR \"=python+\" OR \"=python3%\" OR \"=python3+\" OR \"=ipconfig\" OR \"=wget%\" OR \"=wget+\" OR \"=curl%\" OR \"=curl+\" OR \"=certutil\" OR \"=copy%20%5C%5C\" OR \"=dsquery%\" OR \"=dsquery+\" OR \"=nltest%\" OR \"=nltest+\")))\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time | eval Alert_Severity=\"Medium\"  \n|  stats values(client_ip) as client_ip, values(src_ip) as src_ip , values(dest_ip) as dest_ip , values(dest_port) as dest_port , values(http_referrer) as http_referrer , values(http_user_agent)\
    \ as http_user_agent , values(http_x_forwarded_for) as http_x_forwarded_for , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server , values(Status_Code) as Status_Code , values(uri_path) as uri_path , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity Time vendor_product\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"

