title: FPT - xPlat - Source IP From Internet Send HTTP Request Over Threshold 3000 Req/Min
id: 898b3d3e-015d-5315-8486-dbf6b0fd3579
status: test
description: 'Imported from lab-enabled-rules.csv for tenant lab: FPT - xPlat - Source IP From Internet Send HTTP Request Over Threshold 3000 Req/Min'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.lab
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "`xplat_access_log`  \n|  search status_code!=304 AND http_request_uri_without_query!=/delivery/* AND http_request_uri_without_query!=/my/apiv1/* AND http_request_uri_without_query!=/dang-ky-thi AND  http_request_uri_without_query!=/auth/realms/xcbt-my-hust/protocol/openid-connect/token AND http_request_uri_without_query!=/_next/static/*.js\t AND http_request_uri_without_query!=*.css AND http_request_uri_without_query!=*.png  AND http_request_uri_without_query!=*.ico  AND http_request_uri_without_query!=*.svg AND http_request_uri_without_query!=*.json AND http_request_uri_without_query!=*.chunk.js AND http_request_uri_without_query!=//assets/*  AND http_request_uri_without_query!=/assets/* AND http_request_uri!=*.gif AND http_request_uri!=*.min.js NOT (client_ip=\"10.0.0.0/8\" OR client_ip=\"172.16.0.0/12\" OR client_ip=\"192.168.0.0/16\" OR client_ip=\"1.52.0.0/14\" OR client_ip=\"1.53.0.0/14\" OR client_ip=\"1.54.0.0/14\" OR client_ip=\"118.68.0.0/14\") \n| bucket _time\
    \ span=1h\n| convert timeformat=\"%m-%d-%Y %H:%M:%S\" ctime(_time) as \"Detected Time\" \n| lookup local=t asn ip AS client_ip\n| iplocation client_ip \n| rex field=service_name \"^(?<service_name>[^-]*-[^-]*-[^-]*)\"\n| join type=left service_name [inputlookup xplat_service_owner_2.csv \n    |  table service_name service_owner]\n| stats values(http_request_query_string) values(status_code)  values(http_method) values(server_name) values(service_name) values(service_owner) values(http_request_uri) count by \"Detected Time\" client_ip autonomous_system Country \n| sort  - count\n| where count >= 3000\n| rename values(http_request_query_string) as \"http_request_query_string\", values(status_code) as \"status_code\", values(http_method) as http_method, values(server_name) as server_name, values(http_request_uri) as http_request_uri, values(service_name) as \"Service Name\", values(service_owner) as \"Service Owner\""

