title: Antivirus Hacktool Detection
rule_type: detection
id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
status: stable
description: |
    Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool.
    This event must not be ignored just because the AV has blocked the malware but investigate, how it came there in the first place.
references:
    - source_ref: sigma:fa0c05b6-8ad3-468d-8231-c1cbccb64fba
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2021-08-16
modified: 2024-11-02
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: antivirus
    product: any
    service: any
detection:
    selection:
        - Signature|startswith:
              - 'ATK/'  # Sophos
              - 'Exploit.Script.CVE'
              - 'HKTL'
              - 'HTOOL'
              - 'PWS.'
              - 'PWSX'
              - 'SecurityTool'
              # - 'FRP.'
        - Signature|contains:
              - 'Adfind'
              - 'Brutel'
              - 'BruteR'
              - 'Cobalt'
              - 'COBEACON'
              - 'Cometer'
              - 'DumpCreds'
              - 'FastReverseProxy'
              - 'Hacktool'
              - 'Havoc'
              - 'Impacket'
              - 'Keylogger'
              - 'Koadic'
              - 'Mimikatz'
              - 'Nighthawk'
              - 'PentestPowerShell'
              - 'Potato'
              - 'PowerSploit'
              - 'PowerSSH'
              - 'PshlSpy'
              - 'PSWTool'
              - 'PWCrack'
              - 'PWDump'
              - 'Rozena'
              - 'Rusthound'
              - 'Sbelt'
              - 'Seatbelt'
              - 'SecurityTool'
              - 'SharpDump'
              - 'SharpHound'
              - 'Shellcode'
              - 'Sliver'
              - 'Snaffler'
              - 'SOAPHound'
              - 'Splinter'
              - 'Swrort'
              - 'TurtleLoader'
    condition: selection
falsepositives:
    - Unlikely
fields:
    - _time
    - host
    - Signature
    - file_name
    - file_hash
    - action_taken
level: high

x_query:
    splunk: |
        index=$index$ sourcetype=$sourcetype$ AND (Signature IN ("ATK/*", "Exploit.Script.CVE*", "HKTL*", "HTOOL*", "PWS.*", "PWSX*", "SecurityTool*") OR Signature IN ("*Adfind*", "*Brutel*", "*BruteR*", "*Cobalt*", "*COBEACON*", "*Cometer*", "*DumpCreds*", "*FastReverseProxy*", "*Hacktool*", "*Havoc*", "*Impacket*", "*Keylogger*", "*Koadic*", "*Mimikatz*", "*Nighthawk*", "*PentestPowerShell*", "*Potato*", "*PowerSploit*", "*PowerSSH*", "*PshlSpy*", "*PSWTool*", "*PWCrack*", "*PWDump*", "*Rozena*", "*Rusthound*", "*Sbelt*", "*Seatbelt*", "*SecurityTool*", "*SharpDump*", "*SharpHound*", "*Shellcode*", "*Sliver*", "*Snaffler*", "*SOAPHound*", "*Splinter*", "*Swrort*", "*TurtleLoader*"))