title: FPT - BruteForce Attack on Linux
id: 9e7fbe1d-78c7-5626-b229-613222a0a633
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - BruteForce Attack on Linux'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=linux_* tag=authentication \"*fail*\"\n| bucket _time span=15m\n| eval Alert_Severity=\"High\"  \n| stats values(ip) as IP values(sourcetype) as \"Source Type\" values(hostname) as Host_Name count by Alert_Severity _time username\n| where count > 10\n| rename username as \"User Name\"\n| fillnull value=N/A Host_Name"
