title: FPT - Creation Of An User Account
id: c6836463-9419-566f-b4e6-413429ba4261
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - Creation Of An User Account'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=linux_audit ((type=\"SYSCALL\" AND exe=\"*/useradd\") OR type=\"ADD_USER\")\n| convert timeformat=\"%H:%M:%S %Y/%m/%d\" ctime(_time) as Time \n| eval Alert_Severity=\"Medium\"\n| stats count by Alert_Severity Time src_user_name command action terminal addr"
