title: FPT - DNS Query to External Service Interaction Domains
id: ea658e52-3982-5b66-8589-e4173fb07d8c
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - DNS Query to External Service Interaction Domains'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=netdns AND sourcetype=MSAD:NT6:DNS questionname=* direction=Snd (src_ip=\"10.0.0.0/8\" OR src_ip=\"172.16.0.0/12\" OR src_ip=\"192.168.0.0/16\") \nNOT (src_ip=8.8.8.8 OR src_ip=10.15.30.254 OR src_ip=10.15.16.68 OR src_ip=10.15.16.65 OR src_ip=10.15.16.69 OR src_ip=10.1.1.13 OR src_ip=10.1.1.54 OR src_ip=10.1.1.51 OR src_ip=10.15.16.70 OR src_ip=1.1.1.1 OR src=10.225.6.52 OR src=10.14.132.16 OR src=10.15.6.11 OR questionname=\"polling.oastify.com\")\n| eval questionname=replace(questionname,\"(\\(\\d+)\\)\",\".\") \n| eval questionname=replace(questionname,\"^.\",\"\") \n| eval questionname=replace(questionname,\".$\",\"\")\n| search (questionname = \"*.interact.sh\" OR questionname = \"*.oast.pro\" OR questionname = \"*.oast.live\" OR questionname = \"*.oast.site\" OR questionname = \"*.oast.online\" OR questionname = \"*.oast.fun\" OR questionname = \"*.oast.me\" OR questionname = \"*.burpcollaborator.net\" OR questionname = \"*.oastify.com\" OR questionname = \"\
    *.canarytokens.com\" OR questionname = \"*.requestbin.net\" OR questionname = \"*.dnslog.cn\")\n| convert timeformat=\"%m/%d/%Y %H:%M:%S\" ctime(_time) AS Time\n| eval Alert_Severity=\"Medium\"\n| stats values(questionname) as Domain_Name values(action) as Action earliest(Time) as Start_Time latest(Time) as End_Time count by Alert_Severity src_ip"
