title: FPT - ESXi SSH Password-Spraying Detection
id: f7321679-cd79-5f13-a3e7-bddedd05cb90
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - ESXi SSH Password-Spraying Detection'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: critical
x_splunk_es:
  targets: {}
  search_query: "index=esxi sourcetype=* eventtype=failed_login\n| bucket _time span=15m\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"Critical\" \n| stats values(User) as User dc(User) as Discount_User count by Alert_Severity Time host src_ip\n| where Discount_User>=10 and count>=50"
