title: FPT - Log4j RCE CVE-2021-44228 Detected
id: 4224c5d3-5336-5ce2-91e0-dc415abcd66f
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - Log4j RCE CVE-2021-44228 Detected'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: high
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" ((\"*${jndi:ldap:/*\" OR \"*${jndi:rmi:/*\" OR \"*${jndi:ldaps:/*\" OR \"*${jndi:dns:/*\" OR \"*/$%7bjndi:*\" OR \"*%24%7bjndi:*\" OR \"*$%7Bjndi:*\" OR \"*%2524%257Bjndi*\" OR \"*%2F%252524%25257Bjndi%3A*\" OR \"*${jndi:${lower:*\" OR \"*${::-j}${*\" OR \"*${jndi:nis*\" OR \"*${jndi:nds*\" OR \"*${jndi:corba*\" OR \"*${jndi:iiop*\" OR \"*Reference Class Name: foo*\" OR \"*${${env:BARFOO:-j}*\" OR \"*${::-l}${::-d}${::-a}${::-p}*\" OR \"*${base64:JHtqbmRp*\" OR \"*${${env:ENV_NAME:-j}ndi${env:ENV_NAME:-:}$*\" OR \"*${${lower:j}ndi:*\" OR \"*${${upper:j}ndi:*\" OR \"*${${::-j}${::-n}${::-d}${::-i}:*\") NOT (\"*w.nessus.org/nessus*\" OR \"*/nessus}*\"))\nNOT Status_Code=4*\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) as Time | eval Alert_Severity=\"High\"  \n|  stats values(client_ip) as client_ip, values(src_ip) as src_ip , values(dest_ip) as dest_ip , values(dest_port) as dest_port\
    \ , values(http_referrer) as http_referrer , values(http_user_agent) as http_user_agent , values(http_x_forwarded_for) as http_x_forwarded_for , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server , values(Status_Code) as Status_Code , values(uri_path) as uri_path , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity Time vendor_product\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"
