title: FPT - P2P Request over 12000 Threshold by Nginx Access
id: b61cb1b9-6943-5923-87da-972b6a63e230
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - P2P Request over 12000 Threshold by Nginx Access'
author: soc_monitor
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=nginx:plus:access server=* NOT (src_ip=\"10.14.131.3\" OR src_ip=\"10.15.6.11\") \n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time | eval Alert_Severity=\"Medium\"  \n| stats values(dest_port) as Dest_Port values(http_user_agent) as HTTP_User_Agent values(uri_path) as URI_Path count by Alert_Severity Time src_ip dest_ip server\n| eval HTTP_User_Agent=mvindex(HTTP_User_Agent,0,4)\n| eval URI_Path=mvindex(URI_Path,0,4)\n| sort - count\n| where count>=12000"
