title: FPT - Possible Brute Force Attack by User
id: fe6a23d5-c9c8-505c-8402-153fd948100a
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - Possible Brute Force Attack by User'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"*WinEventLog*\" EventID=4625 user!=\"\" src!=- src_ip!=- user!=*$\n| bucket _time span=15m\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time | eval Alert_Severity=\"Medium\"  \n| stats count(eval(action=\"failure\")) as failures values(Source_Workstation) as Source_Workstation values(name) as Messages values(src_ip) as src_ip values(dest) as dest by Alert_Severity Time user\n| where failures>=100\n| sort - failures"
