title: FPT - Suspicious Windows Strings In URI Detected
id: 6dccc379-a555-5bc5-889a-ac0d5362ff4a
status: test
description: 'Imported from fis-enabled-rules.csv for tenant fis: FPT - Suspicious Windows Strings In URI Detected'
author: admin
date: '2026-03-11'
modified: '2026-03-11'
tags:
- imported.csv
- tenant.fis
- splunk
logsource:
  category: custom
  product: splunk_import
  service: search
detection:
  selection: {}
  condition: selection
falsepositives:
- Unknown
level: medium
x_splunk_es:
  targets: {}
  search_query: "index=* sourcetype=\"nginx:plus:access\" source=\"/var/log/audit/log/*access.log*\" (uri_query=\"*=C:/Users*\" OR uri_query=\"*=C:/Program%20Files*\" OR uri_query=\"*=C:/Windows*\" OR uri_query=\"*=C%3A%5CUsers*\" OR uri_query=\"*=C%3A%5CProgram%20Files*\" OR uri_query=\"*=C%3A%5CWindows*\" OR URL=\"*=C:/Users*\" OR URL=\"*=C:/Program%20Files*\" OR URL=\"*=C:/Windows*\" OR URL=\"*=C%3A%5CUsers*\" OR URL=\"*=C%3A%5CProgram%20Files*\" OR URL=\"*=C%3A%5CWindows*\") NOT (src_ip=\"10.14.131.3\")\n| bucket _time span=1h\n| convert timeformat=\"%Y/%m/%d %H:%M:%S\" ctime(_time) AS Time | eval Alert_Severity=\"Medium\" \n|  stats values(client_ip) as client_ip, values(src_ip) as src_ip , values(dest_ip) as dest_ip , values(dest_port) as dest_port , values(http_referrer) as http_referrer , values(http_user_agent) as http_user_agent , values(http_x_forwarded_for) as http_x_forwarded_for , values(http_x_header) as http_x_header , values(Method) as Method , values(server) as Attack_Server\
    \ , values(Status_Code) as Status_Code , values(uri_path) as uri_path , values(uri_query) as uri_query , values(URL) as URL , values(user) as user, values(Agent) as Agent count by Alert_Severity Time vendor_product\n|  fillnull value=N/A client_ip src_ip dest_ip dest_port http_referrer http_user_agent http_x_forwarded_for http_x_header Method Attack_Server Status_Code uri_path uri_query URL user Agent"
