artifact_schema_version: 1.0
artifact_type: tenant_rule
id: 78cc2dd2-7d20-4d32-93ff-057084c38b93
tenant_id: demo
siem_id: splunk
source_rule:
  rule_id: 78cc2dd2-7d20-4d32-93ff-057084c38b93
  rule_name: av_password_dumper
  rule_type: detection
  source_path: rules/detections/category/antivirus/av_password_dumper.yml
  status: stable
  level: critical
  version: null
display_name: mcafee-epo - Antivirus Password Dumper Detection
metadata:
  tags:
  - attack.credential-access
  - attack.t1003
  - attack.t1558
  - attack.t1003.001
  - attack.t1003.002
  owner: Florian Roth (Nextron Systems), Arnim Rupp
  last_rendered: '2026-03-30T08:45:52Z'
x_splunk_es:
  targets:
    ingest_targets:
    - device_id: mcafee-epo
      dataset_id: mcafee-epo-syslog
      index: epav
      sourcetype: mcafee:epo:syslog
    device_id: mcafee-epo
    dataset_id: mcafee-epo-syslog
    index: epav
    sourcetype: mcafee:epo:syslog
    schedule_cron: '*/30 * * * *'
    earliest: -30m
    latest: now
    notable:
      enabled: true
      severity: critical
      risk_score: 90
    enabled: true
  search_query: |-
    ((index=epav sourcetype=mcafee:epo:syslog)) (signature="PWS*" OR signature IN ("*Certify*", "*DCSync*", "*DumpCreds*", "*DumpLsass*", "*DumpPert*", "*HTool/WCE*", "*Kekeo*", "*Lazagne*", "*LsassDump*", "*Mimikatz*", "*MultiDump*", "*Nanodump*", "*NativeDump*", "*Outflank*", "*PShlSpy*", "*PSWTool*", "*PWCrack*", "*PWDump*", "*PWS.*", "*PWSX*", "*pypykatz*", "*Rubeus*", "*SafetyKatz*", "*SecurityTool*", "*SharpChrome*", "*SharpDPAPI*", "*SharpDump*", "*SharpKatz*", "*SharpS.*", "*ShpKatz*", "*TrickDump*"))
    | bucket _time span=15m
    | convert timeformat="%Y/%m/%d %H:%M:%S" ctime(_time) as Time
    | eval Alert_Severity="High"
    | stats values(action) as action_taken values(TargetName) as file_name values(TargetPath) as file_path values(file_hash) as file_hash values(dest_host) as hostname values(source_process_name) as processname values(signature) as threat_name values(user) as user count by Alert_Severity Time dest_ip
    | fillnull value=N/A action_taken file_name file_path file_hash processname user
